; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image3 - mode
	thermograph2 - mode
	spectrograph0 - mode
	spectrograph1 - mode
	GroundStation1 - direction
	Star3 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation0 - direction
	GroundStation5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 image3)
	(calibration_target instrument0 Star2)
	(supports instrument1 spectrograph0)
	(supports instrument1 image3)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
)
(:goal (and
	(have_image Star6 thermograph2)
	(have_image Star7 spectrograph1)
	(have_image Star8 spectrograph0)
	(have_image Planet9 image3)
	(have_image Phenomenon10 spectrograph0)
	(have_image Star11 thermograph2)
	(have_image Star12 spectrograph1)
	(have_image Planet13 spectrograph0)
	(have_image Star14 spectrograph0)
))

)

; plan
1. (turn_to satellite0 groundstation0 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 9
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 9
3. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 9
4. (turn_to satellite0 planet9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet9)
   goals met: 0 of 9
5. (take_image satellite0 planet9 instrument1 image3)
   added: (have_image planet9 image3)
   goals met: 1 of 9
6. (turn_to satellite0 planet13 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet13)
   goals met: 1 of 9
7. (take_image satellite0 planet13 instrument1 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 2 of 9
8. (turn_to satellite0 phenomenon10 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 9
9. (take_image satellite0 phenomenon10 instrument1 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 3 of 9
10. (turn_to satellite0 star11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star11)
   goals met: 3 of 9
11. (take_image satellite0 star11 instrument1 thermograph2)
   added: (have_image star11 thermograph2)
   goals met: 4 of 9
12. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 4 of 9
13. (take_image satellite0 star12 instrument1 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 5 of 9
14. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 5 of 9
15. (take_image satellite0 star14 instrument1 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 6 of 9
16. (turn_to satellite0 star6 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star6)
   goals met: 6 of 9
17. (take_image satellite0 star6 instrument1 thermograph2)
   added: (have_image star6 thermograph2)
   goals met: 7 of 9
18. (turn_to satellite0 star7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star7)
   goals met: 7 of 9
19. (take_image satellite0 star7 instrument1 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 8 of 9
20. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 8 of 9
21. (take_image satellite0 star8 instrument1 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 9 of 9
